module.exports = {
  // Максимальная длина строки до переноса
  printWidth: 100,
  // Размер табуляции
  tabWidth: 2,
  // Использовать пробелы, а не табы
  useTabs: false,
  // Всегда ставить точку с запятой
  semi: true,
  // Одинарные кавычки вместо двойных
  singleQuote: true,
  // Ставить запятую в конце последнего элемента
  trailingComma: 'all',
  // Пробелы внутри фигурных скобок
  bracketSpacing: true,
  // Всегда оборачивать параметры стрелочных функций в ()
  arrowParens: 'always',
  // Унифицировать переводы строк
  endOfLine: 'lf',
};
